import butinsky from '../assets/bk_butinsky.jpeg'
import maurits from '../assets/maurits.jpeg'
import nalichnik from '../assets/nalichnik.jpeg'
import nalichnik_long from '..//assets/nalichnik_long.jpeg'
import mihail from '../assets/mihail.jpg'
import mihail_full from '../assets/mihail-full.jpeg'
import kolobovnikov_home from '../assets/kolobovnikov_home.png'
import mirror from '../assets/mirror.webp'
import long_mirror from '../assets/long_mirror.jpeg'

import riph_shop from '../assets/architectural_monument/riph_shop.jpg'
import verhityrov_home from '../assets/architectural_monument/verhityrov_home.jpg'
import ryzikov_home from '../assets/architectural_monument/ryzikov_home.jpg'
import theological_school_2 from '../assets/architectural_monument/theological_school_2.jpeg'
import shmulevsky_home from '../assets/architectural_monument/shmulevsky_home.jpg'
import guests_home from '../assets/architectural_monument/guests_home.jpeg'
import culture_house from '../assets/architectural_monument/culture_house.jpeg'
import mihailov_school from '../assets/architectural_monument/mihailov_school.jpeg'
import koryakin_house from '../assets/architectural_monument/koryakin_house.jpg'
import vine_house from '../assets/architectural_monument/vine_house.jpeg'
import square from '../assets/architectural_monument/square.jpg'


export const gallery = [
    {
    image: butinsky,
    long_image: butinsky,
    title: "Нерчинский краеведческий музей им. М.Д. Бутина",
    key: 0,
    place: "butinsky",
    adress: "Советская ул., 83",
    coordinate: { latitude: 51.97879, longitude: 116.58470 },
    info: "Визитной карточкой Нерчинска явяляется Дворец Михаила Дмитриевича Бутина или Бутинский дворец. Бутин – это знаменитый нерчинский купец, золотопромышленник и мецената.  Имя хозяина столь  прекрасного здания стало  в последние годы широко известно забайкальцам благодаря изданию романа О.А. Хавкина «Дело Бутиных». А вот история любимого его детище – огромнейшего каменного дома в Нерчинске еще более интересна, сказала бы, что даже загадочна. И по сей день, он хранит в себе множество таен и легенд. А вот  самая главная из них – это равнодушное отношение людей  к судьбе дворца. Может ни в один миг, но постепенно гордость Нерчинска  превратилась в позор города. Следует отметить, что этот процесс начался еще при жизни его Бутина, в конце прошлого столетия. \n Семьей Бутиных разрабатывались Вершино-Дарасунские золотые прииски. Потомственные купцы Николай и Михаил Бутины к середине 60-х годов XIX века уже имели состояние такое, что могли обзавестись большой усадьбой. С этой целью ими был куплен участок земли в центре города, принадлежавший до этого момента протоиерею Кириллу Суханову. Купцы задумывали сделать главное здание своей усадьбы максимально удобным и универсальным по своему назначению. Помимо жилых помещений, в нем должны были расположиться  главные учреждения основанного ими «Торгового дома»: контора, магазин, склад и т. д. Исходя из этого, полезная площадь здания должна была быть внушительной. Бутины решили вести строительство не ввысь, а вширь, результатом которого явился вытянувшийся в полквартала, одноэтажный в своей основе, дворец. Венцом его стал трехэтажный юго-восточный фасад, выполненный в Мавританском стиле. \n Внутреннее убранство Бутинского дворца поражало своей роскошью и великолепием. Среднее окно вестибюля украшал цветной витраж, на котором был  изображен архангел Михаил, поражающий  дьявола. Данное произведение было  изготовлено в Мюнхене в 1857 году. В огромном зале располагались самые большие по тем временам зеркала, выполненные из венецианского стекла. Они были  куплены М.Д. Бутиным на Парижской выставке в 1878 году. Как раз, одно из зеркал, размер которого составляет 4 на 4 метра. Работники музея утверждают, что такого это самое большое зеркало и, более нет во всем мире. На протяжении двух веков спорили, как зеркало вносили в дворцовый зал. Несколько лет назад раскрылась эта загадка:  для того, чтобы зеркало сюда попало, оказывается, разбирали крышу."
  },
    {
      image: mihail,
      long_image: mihail_full,
      title: "Архангел \n Михаил",
      key: 1,
      place: "butinsky",
      adress: "Советская ул., 83",
      coordinate: { latitude: 51.97879, longitude: 116.58470 },
      info: 'Витраж Ф.К. Цеттлера "Архангел Михаил, поражающий дьявола", который хранится музее. Изготовлен в 1870-е гг., принадлежал нерчинскому купцу, золотопромышленнику и меценату Михаилу Дмитриевичу Бутину, расположен в центральном окне вестибюля его дворца и по сей день. Известно, что мастерская Ф.К.Цеттлера была одной из самых известных в Германии в 19 веке, она существовала с 1870 г. по 1930-е, когда слилась с мастерской Майера. Сюжет «Архангел Михаил, поражающий дьявола» был распространен в то время и в церковных и в светских витражах'
    },
    {
      image: nalichnik,
      long_image: nalichnik_long,
      title: "Наличники",
      key: 2,
      coordinate: { latitude: 51.97879, longitude: 116.58470 }, 
      place: "nalichnik"
    },
    {
      image: mirror,
      long_image: long_mirror,
      title: "Зеркала",
      key: 3,
      adress: "Советская ул., 83",
      coordinate: { latitude: 51.97879, longitude: 116.58470 },
      place: "butinsky"
    },
    {
      image: maurits,
      long_image: maurits,
      title: "Т. Д. Мауриц",
      key: 4,
      adress: "Парк ",
      coordinate: {latitude: 51.980259, longitude: 116.584122},
      place: "park"
    },
    {
      image: kolobovnikov_home,
      long_image: kolobovnikov_home,
      title: "Памятники \n Архитектуры",
      key: 5,
      coordinate: { latitude: 51.97879, longitude: 116.58470 },
      place: "house"
    }]
    
   export const architectural_monument = [
    {
      image: kolobovnikov_home,
      long_image: kolobovnikov_home,
      title: "Дом колобовниковых",
      key: 0,
      coordinate: { latitude: 51.974621, longitude: 116.585900 },
      place: "house",
      info: "Оригинальный пример крупного одноэтажного здания начала XX века, не имеющего аналогов в городе, но с традиционной итальянской галереей парадного входа. Имеет П-образный в плане объем с крыльями, развитыми вглубь двора, и симметричными ризалитами по флангам главного фасада. Протяженные фасады дома сплошь прорезаны прямоугольными окнами с фигурными сандриками наличников. По фризу проходит пропильная резьба, характерная для Железнодорожных построек того времени. Неординарный облик дому придает сложная кровля: фронтоны с полувальмами на ризалитах и боковых фасадах, чешуйчатые башенки с кованными металлическими решетками. \n Дом принадлежал семье купцов Колобовниковых, приехавших в Нерчинск из Нижегородской губернии в конце XIX века, и организовавших здесь крупную торговую фирму. Б Советское время в доме располагались различные административные учреждения, а затем Детская художественная школа."
    },
    {
      image: riph_shop,
      long_image: riph_shop,
      title: "Оптовый и розничный магазин Т.И. Рита",
      key: 1,
      coordinate: { latitude: 51.973015, longitude: 116.589960 },
      place: "house",
      info: "Крупное здание, сочетающее двухэтажный основной объем и трехэтажный пристрой на дворовом фасаде. Построено в конце XIX века Нерчинским 1-й гильдии купцом Тиселем Израилевичем Рифом - владельцем золотых приисков в Нерчинском округе, пароходной пристани, паровой мельницы и лесопилки на острове Баронка (ныне п. Приисковый). На тот период один из крупнейших магазинов в Нерчинске. В 1905 году, во время Русско-Японской войны, дом сдавался в аренду переведенной из Владивостока мужской гимназии. Справа от дома располагались массивные арочные ворота, утраченные в 1980-е гг. С Советских времен здание используется в качестве почтового отделения."
    },
    {
      image: verhityrov_home,
      long_image: verhityrov_home,
      title: "Дом Верхотурова",
      key: 2,
      coordinate: { latitude: 51.976103, longitude: 116.586861 },
      place: "house",
      info: "Единственный в Нерчинске кирпичный дом с мезонином. Его объемно-¬планировочное решение и декоративное оформление выполнено с использованием приемов классицизма. Основной композиционный акцент северного (главного) фасада дома - четырехколонный портик, где крайние колонны поддерживают вынос двускатной кровли мезонина, а средние несут широкий балкон. Балкон мезонина южного (дворового) фасада, четырьмя небольшими колонками поддерживающий свес кровли, опирается на высокие металлические кронштейны. Строительство этого здания началось в 1844 году силами 62 рабочих, и уже через год он был полностью готов. Хозяином дома был Нерчинский 3-й гильдии купец Назар Карпович Верхотуров, организовавший первую в городе картинную галерею. В 1850-е гг. дом был продан Нерчинскому 1-й гильдии купцу Михаилу Егоровичу Капараки. В конце 1860-х гг. Капараки сдал дом в аренду под магазин Иркутскому купцу Минееву. В последствии дом выкупили братья Бутины и в 1878 году разместили в нём учреждённую ими же за 10 лет до того Софийскую Женскую Прогимназию, а в 1883 году пожертвовали ей это здание в полное владение. С 1906 по 1908 гг. в Ломе Верхотурова размещалось Нерчинское Реальное училище. В Советское время здесь находились эвакуационный госпиталь, общежитие совхоза-техникума, аптека № 26."
    },
    {
      image: ryzikov_home,
      long_image: ryzikov_home,
      title: "Дом Рыжикова",
      key: 3,
      coordinate: { latitude: 51.981110, longitude: 116.58553 },
      place: "house",
      info: "Каменный двухэтажный дом с большой остеклённой деревянной верандой на втором этаже, построен на рубеже 1880-90-х гг. Нерчинским 2-й гильдии купцом, уроженцем Одессы, Алексеем Ивановичем Рыжковым. Деятельность этого человека была настолько бурной, что даже нашла отражение в книге «Юбилейное историческое и художественное издание в память 300-летия царствования Державного Дома Романовых», напечатанной в А Москве в 1913 году. На протяжении долгого времени Алексей Иванович состоял директором Тюремного Комитета при Нерчинской тюрьме, членом Ведомства Императрииы Марии по детским приютам, был почетным мировым судьёй. На его средства была построена деревянная иерковь при Нерчинском тюремном замке, за что он был Высочайше пожалован званием Потомственного Почетного гражданина и награжден орденом святой Анны 111 степени. Заботился Алексей Иванович и о нуждах народного образования, будучи Почетным Блюстителем Нерчинских Воскресенского и Троиикого приходских училиш, был избран Почетным членом Обшества попечения о народном образовании в Нерчинске. Усадьба Рыжковых была огромной и во многом не уступала по масштабам усадьбе Бутиных. Значительную часть её территории занимал роскошный сад с множеством цветов, кустарников, беседками и оранжереями. По непроверенным данным, в 1920-е гг. здесь находился публичный дом, впоследствии передан в Жилой фонд."
    },
    {
      image: theological_school_2,
      long_image: theological_school_2,
      title: "Дом Рыжикова",
      key: 4,
      coordinate: { latitude: 51.979594, longitude: 116.586342 },
      place: "house",
      info: "Первое (малое) - нетипичный для Нерчинска пример здания, выполненного в смешанной технике: первый этаЖ каменный, второй -деревянный. Строить его под богадельню начал православный священник-миссионер Кирилл Васильевич Суханов. 15 1810 году Суханов умер, а сын его Иван дом Приказу общественного призрения. Тогда это было одноэтажное каменное здание, подведенное под кровлю. К 1829 году дом был надстроен вторым этажом. С тех пор в нем располагались учебные классы, а позЖе и общежитие Нерчинского Духовного училища (бурсы).\n Начало постройке второго (большого) здания таже заложил протоиерей К.В. Суханов, окончанию Же строительства в 1820 году способствовал сам генерал-губернатор Восточной Сибири М.М. Сперанский. Б 1865 г оду здание перешло в собственность Нерчинского Духовного училища, а в 1872 году архитектором В.И. Куликовским на средства М.Д. Бутина было значительно перестроено и приобрело привычный современный вид. Духовное училище располагалось в этих домах вплоть до 1900 года. Затем в большом здании разместилась Софийская Женская гимназия, просуществовавшая до начала 1920-х гг. В Советское время в большом здании находились учреждения, преимущественно связанные с народным образованием, а малое здание было перестроено под квартиры."  
    },
      {
      image: shmulevsky_home,
      long_image: shmulevsky_home,
      title: "Дома Шмулевских",
      key: 5,
      coordinate: { latitude: 51.973383, longitude: 116.586928 },
      place: "house",
      info: "Пример крупных одноэтажных жилых домов начала XX века, выполненных под влиянием городской архитектуры. Главные особенности построек - не характерные для Нерчинска, встречаемые только на этом участке ул. Ярославского и в одной постройке на ул. Кооперативная, 46, пышные наличники и трехступенчатый карниз со спокойной пропильной резьбой. Сочетание традиционных приемов с оригинальными деталями, а такЖе высокий строительный уровень, ставят постройки в ряд наиболее интересных в Нерчинске. Дома принадлежали семье купцов Шмулевских. Нз потомков хозяев дома наиболее известен И.Я. Шмулевский - учитель, Почетный гражданин г. Нерчинска. После эмиграции первоначальных хозяев дома использовались под различные учреждения."
    },
    {
      image: guests_home,
      long_image: guests_home,
      title: "Гостинный двор",
      key: 6,
      coordinate: { latitude: 51.976837, longitude: 116.584902 },
      place: "house",
      info: "В феврале 1832 года Нерчинские купцы ввиду ветхости деревянных лавок нашли необходимым построить новый каменный Гостиный двор. Для этого они решили создать акционерное общество, поделив необходимый для постройки капитал на 200 частей (акций). 11а обшем собрании акционеров 3 1 января 1834 года подрядчиками-строителями Гостиног о двора были выбраны Нерчинские купцы Андрей Афанасьевич Корякин и Александр Иванович Черепанов. К концу 1839 года постройка Гостиного двора была завершена. По смете она обошлась пайщикам в 25000 рублей. Из-за лютых забайкальских морозов торжества по случаю окончания строительства были отлоЖены до весны и состоялись 23 мая 1840 года. Подвергался внутренней перестройке в 1870 и в 1892 гг. Б 1870-80-е гг. 103 акции были выкуплены Нерчинским купцом и золотопромышленником М.Л. Бутиным. Б сентябре 1899 года М.Д. Бутин передал свою долю в распоряжение Попечительского Совета Софийской Женской прогимназии. На тот период купцами, арендовавшими лавки Гостиного двора, были: П.А. Кычаков, И.П. Нижегородцев, В. Бурнакин, И. Толпыгин, П. Белоголовкин, А. Павловский, Юн-Ю-Ху. Позднее к ним присоединился П.Е. Колобовников. С 1897 по 1907 гг. второй этаЖ Гостиного двора занимал Нерчинский публичный музей.После установления в Нерчинске Советской власти здание Гостиного двора было национализировано. На протяжении всего XX века здесь располагались продовольственные магазины, кулинария, в северном, значительно перестроенном крыле - столовая. "
    },
    {
      image: culture_house,
      long_image: culture_house,
      title: "Общественное собрание",
      key: 7,
      coordinate: { latitude: 51.978262, longitude: 116.583942 },
      place: "house",
      info: "Строительство здания началось в середине XIX века. Впоследствии его выкупили братья Бутины и, достроив, передали для нуЖд г орожан. С 1860-х гг. здесь разместилось Общественное собрание.Активную роль в восприятии фасада здания играют поэтаЖные ряды проёмов и ниш различной конфигураиии, расчленённые горизонтальными тягами. Ниши первого этажа имитируют арочную галерею с рустованными столбами. Под кровли, по осям оконных проёмов, расположены ииркульные ниши, в уровне кровли - тумбы. С самого начала здание являлось иентром культурной жизни города. Сюда в 1880-е годы была перемешена музыкальная школа, а с ноября 1886 года в его стенах разместился круЖок любителей музыки и литературы. Кроме этого в Общественном собрании ютились любители азартных, в особенности карточных игр, организовывались торжественные обеды, работал буфет, а в летнее время - «зеленый» ресторан во дворе. В XX веке по бокам здания появились пристройки, входная дверь переместилась в центр, исчез балкон в зале второго этаЖа. Сама Же суть назначения его осталась прежней - здесь и поныне расположен районный культурно-досуговый центр."
      },
      {
        image: mihailov_school,
        long_image: mihailov_school,
        title: "Михайловское приходское училище",
        key: 8,
        coordinate: { latitude: 51.980839, longitude: 116.589639 },
        place: "house",
        info: "Здание построено в 1896-1897 гг. на средства, пожертвованные уроженцем Нерчинска, Московским купцом, одним из основателей курортов на Мацесте (Сочи) Михаилом Михайловичем Зензиновым для основанного им же в 1888 году Михайловского приходского училища. На строительство был затрачен капитал в 3000 рублей. В разные годы в училище обучалось от 47 до 79 учеников, здесь же для учащихся всех городских училищ организовывались литературные вечера. В Советское время здание продолжало использоваться под учебные заведения, а со стороны западного фасада появилась пристройка с дополнительными кабинетами и спортивным залом."
      },
      {
        image: koryakin_house,
        long_image: koryakin_house,
        title: "Дом Корякина",
        key: 9,
        coordinate: { latitude: 51.978487, longitude: 116.584377 },
        place: "house",
        info: "Один из первых кирпичных домов построенных в начале XIX века вскоре после перемещения Нерчинска в долину Сажиков Яр. \n Декор дома выполнен с использованием приёмов классицизма. На симметричном главном фасаде выделен центральный ризалит, рустованный в ниЖней части и раскрепованный пилястрами в верхней. Здание окантовывает межэтажный пояс. Поле над оконными проемами второго этаЖа в пределах ризалита украшено накладными циркульными элементами. Строителем дома был Нерчинский купец Афанасий Андреевич Корякин. При его строительстве он сам с детьми своими (Андреем, Петром и Иваном) делал кирпич, не по гнусной скупости, а по похвальной привычке к труду. \n Следующими владельцами дома стали братья Михаил и Николай Бутины, организовавшие здесь музыкальную школу, а в 1874 дом стал -штаб- квартирой* Нерчинского отделения Императорского Русского музыкального общества - первого в Сибири. Затем дом был продан купцу 3-й гильдии Стефану Васильевичу Чистохину. В Советское время здесь располагались квартиры горожан, позже - китайский рынок и магазины."
        },
        {
          image: vine_house,
          long_image: vine_house,
          title: "Казенная винная монополии",
          key: 10,
          coordinate: { latitude: 51.978185, longitude: 116.581834 },
          place: "house",
          info: "История Казенной винной монополии началась ещё в коние XIX века, в период, когда государство начало стремиться монополизировать производство алкоголя. Первоначально было несколько вариантов месторасположения будущего завода, и Нерчинск и было не упустил возможность иметь это предприятие на своей территории. Лишь вмешательство Михаила Дмитриевича Бутина предопределило его судьбу. Он сумел убедить начальство строить завод в Нерчинске и даЖе безвозмездно отдал под стройку принадлежавшие ему земли. Строительство велось быстрыми темпами, и было закончено в 1903 году. Б годы революиии и гражданской войны завод стал одним из главных объектов города, который в первую очередь старались захватить как красные, так и белые. Поэтому так часто здесь полыхали поЖары и вдоль берега Нерчи текли горящие реки спирта, а в Жилом здании комплекса по очереди располагались штабы красноармейиев и японских интервентов. Б Советское время в г лавном здании располагались ликероводочный завод, кондитерский иех, а затем различные магазины и учреждения бытовых услуг"
        },
        {
          image: square,
          long_image: square,
          title: "Площадь борцов революции",
          key: 11,
          coordinate: { latitude: 51.977041, longitude: 116.585543 },
          place: "house",
          info: "До 1921 года носила названи Базарной и была сформирована в ходе застройки городского центра, начавшейся в 1812  году: с восточной стороны - Воскресенским	собором, с западной Гостиным двором, в северной - домом	Корякина и Общественным	собранием, с южной домом Верхотурова и Универсальным	магазином	Колобовниковых. С 1860-х годов часть	площади была занята	Городским садом (ныне стадион). На остальной  части по краям площади располагались торговые	лавки, а в весенний и осенний сезоны на ней организовывались ярмарки. В апреле 1921 года в центре площади было совершено перезахоронение останков Жертв белого террора, послужившее поводом для ее переименования. В 1969 году на этом Же месте был открыт Мемориал воинам - нерчинцам, погибшим в годы Великой Отечественной войны"
        }
   ]

   const data_nalichink = [
    {
      image: kolobovnikov_home,
      long_image: kolobovnikov_home,
      title: "Памятники \n Архитектуры",
      key: 1,
      coordinate: { latitude: 51.978262, longitude: 116.583942 },
      place: "nalichnik"
    },
    {
      image: kolobovnikov_home,
      long_image: kolobovnikov_home,
      title: "Памятники \n Архитектуры",
      key: 2,
      coordinate: { latitude: 51.97879, longitude: 116.58470 },
      place: "nalichnik"
    },
    {
      image: kolobovnikov_home,
      long_image: kolobovnikov_home,
      title: "Памятники \n Архитектуры",
      key: 3,
      coordinate: { latitude: 51.97879, longitude: 116.58470 },
      place: "nalichnik"
    }
   ]