import butinsky from '../assets/bk_butinsky.jpeg'
import maurits from '../assets/maurits.jpeg'
import nalichnik from '../assets/nalichnik.jpeg'
import nalichnik_long from '..//assets/nalichnik_long.jpeg'
import mihail from '../assets/mihail.jpg'
import mihail_full from '../assets/mihail-full.jpeg'
import kolobovnikov_home from '../assets/kolobovnikov_home.png'
import mirror from '../assets/mirror.webp'
import long_mirror from '../assets/long_mirror.jpeg'

import riph_shop from '../assets/architectural_monument/riph_shop.jpg'
import verhityrov_home from '../assets/architectural_monument/verhityrov_home.jpg'
import ryzikov_home from '../assets/architectural_monument/ryzikov_home.jpg'


export const gallery = [
    {
    image: butinsky,
    long_image: butinsky,
    title: "Нерчинский краеведческий музей им. М.Д. Бутина",
    key: 0,
    place: "butinsky",
    adress: "Советская ул., 83",
    coordinate: { latitude: 51.97879, longitude: 116.58470 },
    info: "Визитной карточкой Нерчинска явяляется Дворец Михаила Дмитриевича Бутина или Бутинский дворец. Бутин – это знаменитый нерчинский купец, золотопромышленник и мецената.  Имя хозяина столь  прекрасного здания стало  в последние годы широко известно забайкальцам благодаря изданию романа О.А. Хавкина «Дело Бутиных». А вот история любимого его детище – огромнейшего каменного дома в Нерчинске еще более интересна, сказала бы, что даже загадочна. И по сей день, он хранит в себе множество таен и легенд. А вот  самая главная из них – это равнодушное отношение людей  к судьбе дворца. Может ни в один миг, но постепенно гордость Нерчинска  превратилась в позор города. Следует отметить, что этот процесс начался еще при жизни его Бутина, в конце прошлого столетия. \n Семьей Бутиных разрабатывались Вершино-Дарасунские золотые прииски. Потомственные купцы Николай и Михаил Бутины к середине 60-х годов XIX века уже имели состояние такое, что могли обзавестись большой усадьбой. С этой целью ими был куплен участок земли в центре города, принадлежавший до этого момента протоиерею Кириллу Суханову. Купцы задумывали сделать главное здание своей усадьбы максимально удобным и универсальным по своему назначению. Помимо жилых помещений, в нем должны были расположиться  главные учреждения основанного ими «Торгового дома»: контора, магазин, склад и т. д. Исходя из этого, полезная площадь здания должна была быть внушительной. Бутины решили вести строительство не ввысь, а вширь, результатом которого явился вытянувшийся в полквартала, одноэтажный в своей основе, дворец. Венцом его стал трехэтажный юго-восточный фасад, выполненный в Мавританском стиле. \n Внутреннее убранство Бутинского дворца поражало своей роскошью и великолепием. Среднее окно вестибюля украшал цветной витраж, на котором был  изображен архангел Михаил, поражающий  дьявола. Данное произведение было  изготовлено в Мюнхене в 1857 году. В огромном зале располагались самые большие по тем временам зеркала, выполненные из венецианского стекла. Они были  куплены М.Д. Бутиным на Парижской выставке в 1878 году. Как раз, одно из зеркал, размер которого составляет 4 на 4 метра. Работники музея утверждают, что такого это самое большое зеркало и, более нет во всем мире. На протяжении двух веков спорили, как зеркало вносили в дворцовый зал. Несколько лет назад раскрылась эта загадка:  для того, чтобы зеркало сюда попало, оказывается, разбирали крышу."},
    {
      image: mihail,
      long_image: mihail_full,
      title: "Архангел \n Михаил",
      key: 1,
      place: "butinsky",
      adress: "Советская ул., 83",
      coordinate: { latitude: 51.97879, longitude: 116.58470 },
      info: 'Витраж Ф.К. Цеттлера "Архангел Михаил, поражающий дьявола", который хранится музее. Изготовлен в 1870-е гг., принадлежал нерчинскому купцу, золотопромышленнику и меценату Михаилу Дмитриевичу Бутину, расположен в центральном окне вестибюля его дворца и по сей день. Известно, что мастерская Ф.К.Цеттлера была одной из самых известных в Германии в 19 веке, она существовала с 1870 г. по 1930-е, когда слилась с мастерской Майера. Сюжет «Архангел Михаил, поражающий дьявола» был распространен в то время и в церковных и в светских витражах'
    },
    {
      image: nalichnik,
      long_image: nalichnik_long,
      title: "Наличники",
      key: 2,
      coordinate: { latitude: 51.97879, longitude: 116.58470 }, 
      place: "nalichnik"
    },
    {
      image: mirror,
      long_image: long_mirror,
      title: "Зеркала",
      key: 3,
      adress: "Советская ул., 83",
      coordinate: { latitude: 51.97879, longitude: 116.58470 },
      place: "butinsky"
    },
    {
      image: maurits,
      long_image: maurits,
      title: "Т. Д. Мауриц",
      key: 4,
      adress: "Парк ",
      coordinate: {latitude: 51.980259, longitude: 116.584122},
      place: "park"
    },
    {
      image: kolobovnikov_home,
      long_image: kolobovnikov_home,
      title: "Памятники \n Архитектуры",
      key: 5,
      coordinate: { latitude: 51.97879, longitude: 116.58470 },
      place: "house"
    }]
    
   export const architectural_monument = [
    {
      image: kolobovnikov_home,
      long_image: kolobovnikov_home,
      title: "Дом колобовниковых",
      key: 0,
      coordinate: { latitude: 51.974960327, longitude: 116.58656311 },
      place: "house",
      info: "Оригинальный пример крупного одноэтажного здания начала XX века, не имеющего аналогов в городе, но с традиционной итальянской галереей парадного входа. Имеет П-образный в плане объем с крыльями, развитыми вглубь двора, и симметричными ризалитами по флангам главного фасада. Протяженные фасады дома сплошь прорезаны прямоугольными окнами с фигурными сандриками наличников. По фризу проходит пропильная резьба, характерная для Железнодорожных построек того времени. Неординарный облик дому придает сложная кровля: фронтоны с полувальмами на ризалитах и боковых фасадах, чешуйчатые башенки с кованными металлическими решетками. \n Дом принадлежал семье купцов Колобовниковых, приехавших в Нерчинск из Нижегородской губернии в конце XIX века, и организовавших здесь крупную торговую фирму. Б Советское время в доме располагались различные административные учреждения, а затем Детская художественная школа."
    },
    {
      image: riph_shop,
      long_image: riph_shop,
      title: "Оптовый и розничный магазин Т.И. Рита",
      key: 1,
      coordinate: { latitude: 51.974960327, longitude: 116.58656311 },
      place: "house",
      info: "Крупное здание, сочетающее двухэтажный основной объем и трехэтажный пристрой на дворовом фасаде. Построено в конце XIX века Нерчинским 1-й гильдии купцом Тиселем Израилевичем Рифом - владельцем золотых приисков в Нерчинском округе, пароходной пристани, паровой мельницы и лесопилки на острове Баронка (ныне п. Приисковый). На тот период один из крупнейших магазинов в Нерчинске. В 1905 году, во время Русско-Японской войны, дом сдавался в аренду переведенной из Владивостока мужской гимназии. Справа от дома располагались массивные арочные ворота, утраченные в 1980-е гг. С Советских времен здание используется в качестве почтового отделения."
    },
    {
      image: verhityrov_home,
      long_image: verhityrov_home,
      title: "Дом Верхотурова",
      key: 2,
      coordinate: { latitude: 51.974960327, longitude: 116.58656311 },
      place: "house",
      info: "Единственный в Нерчинске кирпичный дом с мезонином. Его объемно-¬планировочное решение и декоративное оформление выполнено с использованием приемов классицизма. Основной композиционный акцент северного (главного) фасада дома - четырехколонный портик, где крайние колонны поддерживают вынос двускатной кровли мезонина, а средние несут широкий балкон. Балкон мезонина южного (дворового) фасада, четырьмя небольшими колонками поддерживающий свес кровли, опирается на высокие металлические кронштейны. Строительство этого здания началось в 1844 году силами 62 рабочих, и уже через год он был полностью готов. Хозяином дома был Нерчинский 3-й гильдии купец Назар Карпович Верхотуров, организовавший первую в городе картинную галерею. В 1850-е гг. дом был продан Нерчинскому 1-й гильдии купцу Михаилу Егоровичу Капараки. В конце 1860-х гг. Капараки сдал дом в аренду под магазин Иркутскому купцу Минееву. В последствии дом выкупили братья Бутины и в 1878 году разместили в нём учреждённую ими же за 10 лет до того Софийскую Женскую Прогимназию, а в 1883 году пожертвовали ей это здание в полное владение. С 1906 по 1908 гг. в Ломе Верхотурова размещалось Нерчинское Реальное училище. В Советское время здесь находились эвакуационный госпиталь, общежитие совхоза-техникума, аптека № 26."
    },
    {
      image: ryzikov_home,
      long_image: ryzikov_home,
      title: "Дом Рыжикова",
      key: 3,
      coordinate: { latitude: 51.981316, longitude: 116.585975 },
      place: "house",
      info: "Каменный двухэтажный дом с большой остеклённой деревянной верандой на втором этаже, построен на рубеже 1880-90-х гг. Нерчинским 2-й гильдии купцом, уроженцем Одессы, Алексеем Ивановичем Рыжковым. Деятельность этого человека была настолько бурной, что даже нашла отражение в книге Юбилейное историческое и художественное издание в память 300-летия царствования Державного Дома Романовых», напечатанной в А Москве в 1913 году. На	Протяжении долгого времени	Алексей Иванович состоял директором Тюремного Комитета! при Нерчинской тюрьме, членом \ Ведомства Императрииы Марии по\ детским приютам, был почетным мировым судьёй. На его средства была построена деревянная иерковь при Нерчинском тюремном замке, за что он был Высочайше пожалован званием Потомственного Почетного гражданина и награжден орденом святой Анны 111 степени. Заботился Алексей Иванович и о нуждах народного образования, будучи Почетным Блюстителем Нерчинских Воскресенского и Троиикого приходских училиш, был избран Почетным членом Обшества попечения о народном образовании в Нерчинске. Усадьба Рыжковых была огромной и во многом не уступала по масштабам усадьбе Бутиных. Значительную часть её территории занимал роскошный сад с множеством цветов, кустарников, беседками и оранжереями. По непроверенным данным, в 1920-е гг. здесь находился публичный дом, впоследствии передан в Жилой фонд."
    },

   ]

   const data_nalichink = [
    {
      image: kolobovnikov_home,
      long_image: kolobovnikov_home,
      title: "Памятники \n Архитектуры",
      key: 1,
      coordinate: { latitude: 51.97879, longitude: 116.58470 },
    },
    {
      image: kolobovnikov_home,
      long_image: kolobovnikov_home,
      title: "Памятники \n Архитектуры",
      key: 2,
      coordinate: { latitude: 51.97879, longitude: 116.58470 },
    },
    {
      image: kolobovnikov_home,
      long_image: kolobovnikov_home,
      title: "Памятники \n Архитектуры",
      key: 3,
      coordinate: { latitude: 51.97879, longitude: 116.58470 },
    }
   ]