import butinsky from '../assets/bk_butinsky.jpeg'
import maurits from '../assets/maurits.jpeg'
import nalichnik from '../assets/nalichnik.jpeg'
import nalichnik_long from '..//assets/nalichnik_long.jpeg'
import mihail from '../assets/mihail.jpg'
import mihail_full from '../assets/mihail-full.jpeg'
import kolobovnikov_home from '../assets/kolobovnikov_home.png'
import mirror from '../assets/mirror.webp'
import long_mirror from '../assets/long_mirror.jpeg'

export const gallery = [
    {
    image: butinsky,
    long_image: butinsky,
    title: "Нерчинский краеведческий музей им. М.Д. Бутина",
    key: 0,
    place: "butinsky",
    coordinate: { latitude: 51.97879, longitude: 116.58470 },
    info: "Визитной карточкой Нерчинска явяляется Дворец Михаила Дмитриевича Бутина или Бутинский дворец. Бутин – это знаменитый нерчинский купец, золотопромышленник и мецената.  Имя хозяина столь  прекрасного здания стало  в последние годы широко известно забайкальцам благодаря изданию романа О.А. Хавкина «Дело Бутиных». А вот история любимого его детище – огромнейшего каменного дома в Нерчинске еще более интересна, сказала бы, что даже загадочна. И по сей день, он хранит в себе множество таен и легенд. А вот  самая главная из них – это равнодушное отношение людей  к судьбе дворца. Может ни в один миг, но постепенно гордость Нерчинска  превратилась в позор города. Следует отметить, что этот процесс начался еще при жизни его Бутина, в конце прошлого столетия. \n Семьей Бутиных разрабатывались Вершино-Дарасунские золотые прииски. Потомственные купцы Николай и Михаил Бутины к середине 60-х годов XIX века уже имели состояние такое, что могли обзавестись большой усадьбой. С этой целью ими был куплен участок земли в центре города, принадлежавший до этого момента протоиерею Кириллу Суханову. Купцы задумывали сделать главное здание своей усадьбы максимально удобным и универсальным по своему назначению. Помимо жилых помещений, в нем должны были расположиться  главные учреждения основанного ими «Торгового дома»: контора, магазин, склад и т. д. Исходя из этого, полезная площадь здания должна была быть внушительной. Бутины решили вести строительство не ввысь, а вширь, результатом которого явился вытянувшийся в полквартала, одноэтажный в своей основе, дворец. Венцом его стал трехэтажный юго-восточный фасад, выполненный в Мавританском стиле. \n Внутреннее убранство Бутинского дворца поражало своей роскошью и великолепием. Среднее окно вестибюля украшал цветной витраж, на котором был  изображен архангел Михаил, поражающий  дьявола. Данное произведение было  изготовлено в Мюнхене в 1857 году. В огромном зале располагались самые большие по тем временам зеркала, выполненные из венецианского стекла. Они были  куплены М.Д. Бутиным на Парижской выставке в 1878 году. Как раз, одно из зеркал, размер которого составляет 4 на 4 метра. Работники музея утверждают, что такого это самое большое зеркало и, более нет во всем мире. На протяжении двух веков спорили, как зеркало вносили в дворцовый зал. Несколько лет назад раскрылась эта загадка:  для того, чтобы зеркало сюда попало, оказывается, разбирали крышу."},
    {
      image: mihail,
      long_image: mihail_full,
      title: "Архангел \n Михаил",
      key: 1,
      place: "butinsky",
      coordinate: { latitude: 51.97879, longitude: 116.58470 },
      info: 'Витраж Ф.К. Цеттлера "Архангел Михаил, поражающий дьявола", который хранится музее. Изготовлен в 1870-е гг., принадлежал нерчинскому купцу, золотопромышленнику и меценату Михаилу Дмитриевичу Бутину, расположен в центральном окне вестибюля его дворца и по сей день. Известно, что мастерская Ф.К.Цеттлера была одной из самых известных в Германии в 19 веке, она существовала с 1870 г. по 1930-е, когда слилась с мастерской Майера. Сюжет «Архангел Михаил, поражающий дьявола» был распространен в то время и в церковных и в светских витражах'
    },
    {
      image: nalichnik,
      long_image: nalichnik_long,
      title: "Наличники",
      key: 2,
      coordinate: { latitude: 51.97879, longitude: 116.58470 }, 
      place: "nalichnik"
    },
    {
      image: mirror,
      long_image: long_mirror,
      title: "Зеркала",
      key: 3,
      coordinate: { latitude: 51.97879, longitude: 116.58470 },
      place: "butinsky"
    },
    {
      image: maurits,
      long_image: maurits,
      title: "Т. Д. Мауриц",
      key: 4,
      coordinate: {latitude: 51.980259, longitude: 116.584122},
      place: "park"
    },
    {
      image: kolobovnikov_home,
      long_image: kolobovnikov_home,
      title: "Памятники \n Архитектуры",
      key: 5,
      coordinate: { latitude: 51.97879, longitude: 116.58470 },
      place: "house"
    }]

    